

/*

1.查看所有目标（target）
xcodebuild -list
2.clean工程
xcodebuild clean -configuration ${development_mode} -quiet  || exit
3.


19237695833

1.网商--->开户成功--->验证不成功--->能否调用：获取验证信息接口
     ---> 开户失败--->弹窗提示---> getview
     ---> 开户成功--->验证成功---> 显示金额(v)
2.非网商--->直接调用getview

时政：15分---5
法律：35分---30
公文：10分---7
行测：15分---10
事业单位相关政策：
省情国情
经济概念：
文学常识



新龙货满满、牛里很、货灵通、八骏图(物流端没过)、联帮盛拒绝、泰中储运


登录：
注册：
忘记密码
修改密码
个人中心
设置
关于我们
安全中心-账号禁用

1.中文抽离成国际化配置文件
2.引用使用配置的绝对引用
3.检查无用代码和不需要的log



企业邮箱登录地址：	http://ym.163.com/
姓名：	姜波
手机号码：15982285748
邮箱：	jiangbo@bestfriend.com.cn
密码：	JBO168






1.驾驶证初次注册日期（领证日期）--未上传


1.主线、智通科运、新龙货满满、封板分支






1.负责功能区产业发展资料收集、数据分析研究，及相关报告的起草；
2.负责参与行业研究和功能区内部课题研究；
3.负责功能区上报文件起草。

1.全日制本科及以上学历；
2.具有扎实的文字功底，良好的协调沟通、语言组织能力；
3.具有两年以上办公室、文秘相关工作经历，承担过本部门、本领域综合性文稿的起草撰写。
4.具有相关产业功能区工作经验、在国家、省、市级刊物上发表过相关文章者优先。

1、谈谈您对选聘岗位的认识和理解；
2、个人具备的选聘本岗位的优势；
3、选聘上岗后的实施方案与措施（要求按问题分析、目标、措施、实施步骤展开）。
要求在500字以内，层次清楚语言简练。

产业研究专员
产业研究专员主要是通过对相关产业的市场环境，相关政策，现实需求，区域文化等数据信息进行搜集整理，并在此基础上加以归类、分析，形成具有参考意义的文档，供行业决策参考。因此，需要岗位人员具备较好的文字功底，熟悉各类综合文档的起草撰写，以及较好的沟通交流能力。

相对优势
1.调研经历丰富。在之前的研发工作中，经常会做一些技术调研。例如：shell能不能做到读取指定目录文本信息...。相对于产业研究，应该至少调研的内容不一样，调研的思路和方法是相通的。
2.能够编写爬虫代码，在网络上自动抓取有用信息（根据关键字）
4.较好的文字写作功底,熟练word、ps、excel和ppt等常用办公软件的使用。
5.能够快速处理word或者excel等文件。例如：在8000份excel表格当中找到“收入超过5000”的职工列表（也可以是其他查找条件）。写好程序后，1秒钟搞定。
5.善于总结工作，思维严谨细致，良好的沟通能力、语言表达能力和抗压能力。


1、研究行业产业链，绘制产业链图谱以及产业地图； 
2、收集、整理、分析宏产业信息和国内外相关行业信息与资料，提供相关分析报告； 
3、参与行业研究并形成研究报告，对行业进行深入研究和持续跟踪，搜集保存相关材料； 
4、动态跟踪国家、各部委、以及地方性的相关政策、产业政策以及相关法律法规，辅助相关区域制定产业发展规划； 
5、负责上级领导交办的其他事项。
1.对重点或目标区域产业态和专题的分析研究、报告撰写、并向上级汇报。
2.论证具体产业发展的可行性、明确产业定位,制定产业发展路径。
3.进行产业投资的可行性分析,并提交相关分析报告。
4.分析与外部专业研究机构建立合作关系的必要性,编制区域产业规划,负责合作过程中节点管控、会议组织、成果提交和展示。
5.定期组织论坛、商业活动和交流沙龙等方式,协助完成相关产业、新兴业态的论证和资源对接。
6.参考国内外优秀产业园区或目标产业中的优秀且成熟的案例,对目标区域产业提出构建方案,并组织与相关部门做好落地沟通工作。
7.完成上级交待的其他工作任务

资料收集、数据分析、报告起草、


0.
您的兼容 iOS App 将于2021年1月26日起在 Mac App Store 上提供，除非您通过上方的横幅对其可用性进行编辑。您也可以立即提供 App。
1.
2.
3.
4.创建司机-提交参数没有驾驶证注册日期,
5.创建司机-提交参数没有驾驶证发证日期,brokerauth
6.
7.

case "DrivinglicenseEndTime".toLocaleLowerCase():
                        this.drivinglicenseEndTime = ''
                        break;

//判断3段的日期
      let result3 = /^(\d{1,4})(-|\/)(\d{1,2})\2(\d{1,2})$/.test(fomateDate);
      let result2 = /^(\d{1,4})(-|\/)(\d{1,2})$/.test(fomateDate);

      console.log('resu === ',result2)

[!] Your project does not explicitly specify the CocoaPods master specs repo. Since CDN is now used as the default, you may safely remove it from your repos directory via `pod repo remove master`. To suppress this warning please add `warn_for_unused_master_specs_repo => false` to your Podfile.




1.1249
18238165110
线上：npm run build:weapp 或者npm run build:hcdline
打包脚本：npm run build:hcdtest
真机调试:npm run build:hcdtest或者npm run build:hcddev


2020年工作总结
在过去的一年、得益于全体同事的共同帮助下，我也顺利完成了2020这一年的主要工作。非常感谢公司给了我们平台，感谢同时平日里的细心帮助，能在这个团结、优秀的团队工作，感到十分的荣幸。
回顾这一年的工作，有好的经验，也有很多教训，现将2020总结如下：
开发货超多4.0到4.3版本迭代
1.企业认证字段配置、创建车辆、创建司机字段配置、司机列表、车辆列表调整，ocr识别调整。
2.网商打款验证、提现相关功能，物流端抢单相关功能开发。
3.一键签收、回单编辑、评价系统完善。用户反馈系统开发。账号禁用相关开发
4.小程序个人基础模块开发
5.给各个客户上架ios各版本的app到苹果商店，处理日常审核被拒绝的app，并再次提交审核
6.原生部分ios平台的桥接文件的开发，含原生鹰眼服务、微信打开app配置、极光推送API调整、定位失败回调的处理，部平台上报桥接方法封装等。
7.处理单据统计页面、承运单、回单、运单相关页面接口调整。
8.修复测试过程中出现的bug
9.协助售后，处理一些客户遇到的苹果app和苹果开发者账号相关的问题。
10.接触学习了一些flutter相关的新技术及其他和rn相关的小知识点。
11.公司安排的一些其他任务
避免
从工作中得到的一些心得
1.多分析需求。做任务之前，先把整体需求梳理清楚，把问题先考虑全面，确定需求能否实现，怎么实现，是否存在一些异常的点需要考虑进来，避免对需求理解不全面，导致一些隐藏问题
3.多检查、反复阅读自己的代码，减少工作失误。工作的时候，要多回看自己的代码逻辑.
1.加强自我能力提升。技术发展日新月异，要多关注行业新技术，多参与团队学习分享会，认真思考，仔细分析，提升自己发现问题和解决问题的能力。
2.向周围的人学习。同事之间，取长补短。不懂要多问，不要觉得不懂就不好意思问。
4.热爱工作，积极承担岗位责任。当自己不是特别忙的时候，主动承担团队的其他相关工作，既可以学习新东西，又能够提高团队工作效率。
6.多沟通，提高团队合作效率。遇到需求不是特别明确的地方，积极和产品沟通，和领导说明可能需要调整的地方。保证：产品-开发-测试，三者对需求的理解是一致的，提升开发效率和平台质量。

坚持！说的再多，不能坚持都是白费。在今后的工作中，要坚持最初定下的目标和计划，才能保证各个方面都能达到预期指标。
在未来的工作中，自己会积极主动、尽职尽责，为公司发展贡献一点点力量。



1.小程序-邮箱地址-公众号-域名：目前还是显示的是“huochaoduo”
2.小程序开发者网站上的、注册的应用图标没有替换为“好伙伴”
3.两个端的RCTJShareConfig.plist文件，添加对应的value(参考链接：https://github.com/jpush/jshare-react-native/blob/master/docs/iOSConfig.md)
4.配置URL Schemes（格式：wx + 微信appKey）


git commit --amend -m"这才是要提交的文字"

org.gradle.java.home=/Library/Java/JavaVirtualMachines/jdk1.8.0_241.jdk/Contents/Home
/Library/Internet Plug-Ins/JavaAppletPlugin.plugin/Contents/Home

xxx公司网络货运平台，区别于B2C的车货匹配平台，亦不同于类似B2B的经纪人平台。
平台特点，概括如下：
1、司机端符合无车承运人申报标准，更高于交通运输厅的评审标准。
2、司机端功能强大：给指定物流商下单、司机抢单，实时预估发货费用，提供货物跟踪、回款状态、回单状态跟踪功能。
3、让司机更轻松：核心业务最完善，满足大宗物资运输的需求，解决物流企业最大的痛点-进项问题。
4、增值业务最广泛：基于大宗物资运输，以及普货的车货匹配，商城，加油，ETC，保险，汽车后市场等增值服务，让物流金融真正落实。
5、技术支持最稳定：满足司机端和承运端、货主端的各类需求。

xxx公司网络货运平台，充分考虑了企业的安全问题，保障合法权益，让企业通过平台运输货物更便捷。
物流端，为货主企业、物流企业、社会车辆、金融机构、监管部门提供一站式跨行业系统管理平台；提供统一的订单、运输、结算协同作业、全物流过程可视化监控、专业的订单管理、运输管理、结算管理系统服务；平台对大宗物资运输供应链中的物流、商流、资金流、信息流进行整合，形成大数据中心，从而推动大宗物资贸易产业互联升级，加强信息安全与透明化，提升行业规范。

姓名：	姜波
手机号码：15982285748
邮箱：	jiangbo@bestfriend.com.cn
密码：	JBO168

企业邮箱登录地址：	http://ym.163.com/



7w = 三金（1.9）+ 彩礼贺礼（4.8w）+ 4套衣服（0.6w）+ 烟（0.66w）+ 聊冰雪妈妈生日红包（0.12）= 8.08w
0.8w医院 + 0.26（生活费）+ 0.5婚纱照 + 婚庆0.9 + 车子保险（1.6k） = 2.62w
考试费（500）+ 违章停车（500）+ 回老家的邮费高速费（来回一趟150x4）+ 买菜700= 2.2k

2w

4w 

4 + 7 = 11


1.部平台sdk逻辑修改: 
MainActivity/MainViewControll
第一次进入init，if(持久化){init}else
前后台切换，在前台的，init，if(没有初始化过&&持久化){init}

装车/到站（获取配置），传到原生进行持久化。判断有没有init，没有init，有的话直接。



数字推理：

计算之后：成等差、等比，自然数，自然数平方，自然数立方，循环数或间隔循环（1，2，3，1，2，3，1，2，3）
1.相邻数字加减乘除
2.间隔数字加减乘除



git 回退版本
方法1：git reset --hard
git reset的作用是修改HEAD的位置。
hard指向的版本是最新版本，之后的版本都会被干掉
如果想恢复到之前某个提交的版本，且那个版本之后提交的版本我们都不要了，就可以用这种方法。
具体步骤(3条命令搞定)：

let x = 找到需要回退版本的commit号
git log（找到x）
git reset --hard x
git push -f


4.10.12

1.面向对象的编程思想
2.基础组件的使用
3.本地缓存
4.文件处理类
5.复杂组件的原理和使用
6.内存管理
7.本地数据库使用
8.网络请求post，get，json
9.主流库的使用
10.大型app练习

查看java路
which java
查看java版本
java -version

新龙货满满-物流端
https://apps.apple.com/cn/app/%E6%96%B0%E9%BE%99%E8%B4%A7%E6%BB%A1%E6%BB%A1%E7%89%A9%E6%B5%81%E7%AB%AF-%E7%BD%91%E7%BB%9C%E8%B4%A7%E8%BF%90%E5%B9%B3%E5%8F%B0/id1493906673
新龙货满满-司机端
https://apps.apple.com/cn/app/%E6%96%B0%E9%BE%99%E8%B4%A7%E6%BB%A1%E6%BB%A1%E5%8F%B8%E6%9C%BA%E7%AB%AF-%E7%BD%91%E7%BB%9C%E8%B4%A7%E8%BF%90%E5%B9%B3%E5%8F%B0/id1493893029


货灵通-司机端
https://apps.apple.com/cn/app/%E8%B4%A7%E7%81%B5%E9%80%9A%E5%8F%B8%E6%9C%BA%E7%AB%AF-%E7%BD%91%E7%BB%9C%E8%B4%A7%E8%BF%90%E5%B9%B3%E5%8F%B0/id1502935837
货灵通-物流端
https://apps.apple.com/cn/app/%E8%B4%A7%E7%81%B5%E9%80%9A%E7%89%A9%E6%B5%81%E7%AB%AF-%E7%BD%91%E7%BB%9C%E8%B4%A7%E8%BF%90%E5%B9%B3%E5%8F%B0/id1502936780

泰中储运-司机端
https://apps.apple.com/us/app/%E6%B3%B0%E4%B8%AD%E5%82%A8%E8%BF%90%E5%8F%B8%E6%9C%BA%E7%AB%AF-%E7%BD%91%E7%BB%9C%E8%B4%A7%E8%BF%90%E5%B9%B3%E5%8F%B0/id1501298340
泰中储运-物流端
https://apps.apple.com/us/app/%E6%B3%B0%E4%B8%AD%E5%82%A8%E8%BF%90%E7%89%A9%E6%B5%81%E7%AB%AF-%E7%BD%91%E7%BB%9C%E8%B4%A7%E8%BF%90%E5%B9%B3%E5%8F%B0/id1501298692

刷新环境变量
source bash_profile
查看java jdk目录
/usr/libexec/java_home -V

1.
2.
3.打包大丰车，智通科运，并提交到苹果商城审核

无感冒发烧咳嗽等症状

2-2: 一号物流、泰中储运
2-4: 运捷科技
2-5: 好未来、薪通宝、牛里很


else {
      [super displayLayer:layer];
  }


NSAllowsLocalNetworking
Privacy - Local Network Usage Description
app不会连接到您所用网络上的设备，只会检测与您本地网关的连通性
异步操作的同步化表达
1.适用对象：属于单一公司的用户（薪全科技有限公司网络货运平台下的所有司机）
2.应用的地区：中国
3.只有加入了本公司的用户才能使用装货卸货等功能。其他普通用户，只能浏览一些登录注册，法律协议、个人设置、平台对外公开的订单等基础信息
4.没有付费功能。钱包只用于划拨司机运费


/bin/bash

621226 44020 10549875
*******************安卓打包

1.找到文件：gradle.properties
2.在底部添加jdk路径
org.gradle.java.home=/Library/Java/JavaVirtualMachines/jdk1.8.0_241.jdk/Contents/Home
/Library/Internet Plug-Ins/JavaAppletPlugin.plugin/Contents/Home

./gradlew assemblehcdtestDebug
./gradlew assemblehcdlineDebug

./gradlew assemblehcdlineRelease
./gradlew assemblehcdtestRelease


// http://www.bdhwlxx.com/res.html

rm -rf ~/library/developer/xcode/deriveddata

./gradlew clean


1.cd到安卓目录下
2.执行打包命令 ./gradlew assemblehcdtestDebug
3.打包完成后，执行adb install app/build/outputs/apk/（安装app到链接的手机）。
例如：adb install app/build/outputs/apk/hcdtest/debug/app-hcdtest-debug.apk

完成时候，cd到rn的packjson目录，执行npm start
4.adb reverse tcp:8081 tcp:8081（把手机网络和手机网络同步）平时：该命令在任何目录下执行 ，都是可以的。
5.app启动过程有可能会卡住，重启app就可以了。
6.ok 另外，附带一个模拟 摇一摇reload的命令：adb shell input keyevent  82 (该命令在rn的安卓工程目录下执行)




/Applications/Xcode.app/Contents/Developer/Platforms/iPhoneOS.platform/Developer/SDKs/iPhoneOS.sdk/usr/lib/

/Applications/Xcode.app/Contents/Developer/Platforms/iPhoneSimulator.platform/Developer/SDKs/iPhoneSimulator.sdk/usr/lib/




// ios的RNGlobalConstants
CGFloat height = 0;
  if (@available(iOS 11.0, *)) {
    height = [[[UIApplication sharedApplication] delegate] window].safeAreaInsets.bottom;
  }
  [baseConfig setValue:@(height) forKey:@"tabbarBottom"];


isIphoneX.ts
import {Dimensions, Platform} from 'react-native';
//screen
const {width, height} = Dimensions.get('window');
const RNGlobalConstants = require('../native_module/RNGlobalConstants')
// iPhone X
// const X_SCREEN_WIDTH = 375;
// const X_SCREEN_HEIGHT = 812;

export function isIphoneX() {
  return Platform.OS === 'ios' && (RNGlobalConstants.tabbarBottom > 0)
}


1.react-native init MyApp
2.xcode run 
-->error : 
Showing Recent Messages
Undefined symbol: ___darwin_check_fd_set_overflow

myApp下，npm install

3.xcode run 




一、taro框架升级
参考链接：https://www.jianshu.com/p/676c1af40cba
二、taro小程序脚本采坑
打包大小
三、taro编码规范&样式(sass)
https://nervjs.github.io/taro/docs/2.x/spec-for-taro
四、Taro ui
https://taro-ui.jd.com/#/docs/introduction
五、代码提交流程（同app）
Merge request流程



// 删除制定的stash
git stash drop stash@{0}



第十三届全国人民代表大会第三次会议
1.修改民法典。国家主席习近平签署第45号主席令公布这部法律。
2.建立健全香港特别行政区维护国家安全的法律制度和执行机制的决定
3.
 四川省事业单位考试综合知识整理(包含全书知识点)下载文档
 2
  / 29
 法的 时间效力：法的生效时间主要有以下几种形式
 1.自法律公布之日起；
 2.由该法本身规定生效时间；
 3.由专门决定规定某法的生效时间；
 4.规定法律公布后满足一定条件时生效。
 法的终止效力的时间，有明示废止和默示废止两类
 
           我国现行的立法体制为“一元，两级，多层次”，一元指根据宪法规定我国是一个单一制的、统一的多民族国家，我国有立法体制是统一的一元化的，全国范围内只存在一个统一的立法体系。两级指根据宪法规定，我国立法体制分为中央立法和地方立法两个等级。多层次是指根据宪法规定，不论是中央级立法，还是地方级立法，都可以各自若干个层次和类别。 国家机关立法职能及权限：
 1.全国人大制定和修改刑事、民事、国家机构的和其他的基本法律。全国人大常委会制定和修改除应当由全国人大制定的法律以外的其他法律，在全国人大闭会期间，对全国人大制定的法律进行补充和修改。           2.国务院制定行政法规。           3.国务院各部、委员会、中国人民银行，审计署在本部门的权限范围内，制定规章. 4.省、自治区、直辖市的人民代表大会及其常季会可以制定地方性法规。 5.省、自治区、直辖市可制定规章 6.民族自治地方的人民代表大会制定适用于本民族区域自治范围内的自治条例
 和单行条例。 法律制定程序：法律案提出；法律案的审议；法律草案表决；法律的公布。 法的实施： 包括执法、司法、守法。执法专指国家行政机关、公务员及授权组织依照法定职权和程序，贯彻和实施法律的活动。有以下特征：主体是国这行政机关和所属的公职人员，以及法律授权和委托的组织及人员；执法内容广泛性；执法活动具有单方面性；执法活动具有主动性。司法：又称为“法的适用”，“法律适用”，是指国家司法机关依照法定职权和程序，具体适用法律处理各种案件的专门活动。这种专门活动是以国家名义实现其司法权的活动，属于国家的基本职能之一。守法：是指国家机关、社会组织和公民个人依照法的规定，行使权利（权力）和履行义务（职责）的活动。， 法律关系： 是指法律 在调整社会关系的过程中所产生的人们之间的权利和义务关系。法律关系是以权利义务为内容 的社会关系；法律权利和义务的内容是法律关系
 区别于其他社会关系的重要标志。 法律关系的结构：由主体、客体和内容三大要素构成。法律上的人主要包括法人与自然人。            法人一般可分为企业法人、事业法人、机关法人、社团法人。参加任何法律关系都必须具有权利能力，特定类型的法律除此之外还必须具有行为能力。权利能力是由法律所确认的法律关系主体享有权利或承担义务的资格，是参加任何法律关系都必备的前提条件。公民的权利能力分为一般权利能力（始于出生，终于死亡）和特殊权利能力（如选举权要达到法定年龄为条件）。行为能力是
 法律所确认的，由法律关系主体通过
 自己的行为行使权利和履行义务的能力。三类自然人：完全行为能力人（成年且神智正常）；限制行为能力人（未成年且已满一定年龄的人和患有精神疾病但尚具有识别能力的人）；无行为能力人（未达到一定年龄的幼童和完全失去控制与识别能力的精神病人）。           法律关系的客体通常包括：物、人身利益，智力成果，行为。 法律责任：指行为人由于违法行为、违约行为、或者由于法律的规定而应承受的某种不利的法律后果。分为民事、刑事、行政、违宪责任。           民事责任：主要是财产责任；民事责任可由当时人协商解决；分为违约、一般侵权、特殊侵权、公平责任。 法律责任构成：责任主体、违法行为、损害结果、因果关系、主观过错。其实现形式：惩罚（制裁）、补偿（赔偿）、强制。
 公务员考试2020_历年试题_考点解析_新版教辅
 广告 公务员考试2020精华+出题规律解析+新政考点预测，适用于2020年公务员复习备考 查看详情 >

 第二章  宪法 宪法：    是规定国家根本制度和根本任务、集中表现各种政治力量对比关系、保障公民权利的国家根本法。宪法的修改方面三个小知识点：第一，宪法的修改有两个主体有权提出，即全国人大常委会和1/5以上的全国人大代表。第二，宪法修正案的通过由全国人大以全体的2/3以上的多数通过。第三，全国人大制定的法律由全国人大以全体代表的过半数通过。           1918年全俄苏维埃代表大会制定 了世界第一部社会主义宪法，《苏俄宪法》。           1908年清政府颁布的《钦定宪法大纲》是中国历史上第一个宪法性文件。 国家机构：我国的国家机构由国家元首（国家主席）、权力机关（人大及常委会）、行政机关（政府）、司法机关（法院与检察院）、军事机关所构成。国家机构的组织和活动原则有：1.民主集中制原则；2.法治原则；3.责任制原则。           全国人大是最高权力机关，最高的国家立法机关。每届任期5年。职权有：修改宪法和监督安宪法实施；制定和修改国家基本法律；监督权， 全国人大选举全国人大常委会委员长、秘书长和委员，选举国家主席、副主席，中央军委主席、最高人民法院院长、最高人 民检察院院长，决定国务院总理人选、决定副总理、国务委员、各部部长、各委员会主任、审计长和秘书长的人选，决
 定中央军委副主席和委员人选。           中央人民政府即国务院，是最高国家权力机关的执行机关，是最高国家行政机关。           国家主席的职权：公布法律，发布命令；任免国务院的组成人员和驻外全权代表；外交权；荣典权。           中央军委每届任期5年，但宪法没有对军委主席连续任职问题作出规定。           人民法院是国家的审判机关；人民检察院是国家的监督机关。           各级人民代表大会：我国共有五级人大，即全国、省级、市级、县级、乡级人大。乡级人大没有常委会，也不有刑事豁免权。
         我国有五级人大，相应有五级政府，即中央、省级、市级、县级、乡级政府。 公民的权利与义务：公民的权利有：1.平等权； 2.宗教信仰自由； 3.政治权利和自由（选举权，具备三个条件：中国公民；年满18周岁；没有被剥夺政治权利）； 4.监督权； 5.人身自由； 6.财产权； 7.社会经济、教育、文化方面的权利；8.特定主体的权利。           公民的义务：1.
 维护国家的统一和各民族的团结； 2.遵守宪法和法律； 3.维护祖国的安全、荣誉和利益； 4.保卫祖国。抵抗侵略、依法服兵役和参加民兵组织； 5.依法纳税。此外还有劳动的义务，受教育的义务。 独立自主是中国对外政策的根本原则;和平共处五项原则是中国处理同 一切国家关系的基本准则
 「中公」2020事业单位考试题库-事业单位考试难吗?如何备考?
 广告 2020事业单位考试题库，事业单位考试全程备考尽在中公事业单位! 查看详情 >
 第三章  行政法 行政法：   就是有关国家行政机关的职责、权限、工作原则和活动程序的法律规范的总称，它有以下特征：行政法尚未形成统一、完整的实体法典；行政法律规范的数量众多、内容广泛；行政法的内容定于多变性。 行政法基本原则;1.行政合法性原则 ；2.行政合理性原则。 行政法律关系主体：1.行政主体，主要包括：行政机关,行政机关是最主要的行政主体，但不是所有行政机关都能成为行政主体，能灰飞烟灭的有国务院、国务院组成部门、国务院直属机构、地方各级人民政府、地主人民政府的工作部门、地主人 民政府的派出机关；派出相关及派出机构；法律法规授权的组织。            2.行政相对人，简称相对人，是指在行政管理 中处于被管理地位的公民、法人、或其他组织。 行政授权： 是指法律、法规、规章对一个本无独立行政职权的机构或者组织，授予行政职权从而使具备行政主体的资格 的行为。 行政委托： 是指导行政机关在其他职权职责范围内依法将其行政职权或行政事项委托给有关行政机关、这会组织或个人。 行政行为：是指行政主体在实施行政管理活动、行使行政职权过程中所作出的具有法律意义的行为。特征有：行政行为必须是行政主体所为的行为；行政行为是行使行政职权的行为。抽象行政行为：也称“行政立法行为”，是具体行政行为的对称，其对象具有普遍性。抽象行政行为具有以下特征：1.对象的普遍性；2.效力的普遍性的持续性；3.准立法性；4.不可诉性。具体行政行为，是指行政机关行使政权力，对特定公民、法人、和其他组织作出的有关其权利义务的单方行为。            1.行政处罚，是指法定的行政主体对违反行政法律规范，破坏行政法律秩序但尚未构成犯罪的公民、法人、其他组织所实施的惩戒行为。处罚类型有：（1）警告；（2）罚款；（3）没收；（4）责令停产停业；（5）暂扣或吊销许可证、执照；（6）行政拘留；（7）法律、行政法规规定的其他行政处罚。            2.行政许可，是一种依申请有的行政行为；是授益性行为，是要式行政行为。分为一般许可；特许；认可；核准；登记。原则上只有全国人大及其党委会、国务院和省级地方人大及常委会可以设定行政许可。            3.行政强制，强制措施及强制执行。对人身自由的强制措施有以下几种：强制隔离；强制治疗；收容教育；强制戒毒；除以上几种外，还有对不接受传唤或逃避传唤的人实施的强制传唤、对公共场所酗酒的人实施的强制约束、对闹事者采取的强行带离现场或驱散等。针对 涉案财产所采取的强制措施有：查封；扣押；冻结。强制执行；分直接和间接执行（代执行和代行罚）                       4.行政裁决，其特征为：主体是法律授权的特定的行政机关；对象是特定的民事纠纷；是行政主体实行的一种特殊的具体行政行为；具有准司法性，行政机关在实施行政裁决时是以第三者的身份居间裁决民事纠纷，有司法性质，同时又是以行政机关的身份裁决争议，具有行政性质。 行政复议： 行政复议机关依法对具体行政行为的合法性、合理性进行审查。公民、法人、其他组织可以依法申请行政复议的情形有：对行政机关作出的行政处罚不服的；对行政强制措施不服的；对行政机关作出的有关许可证、执照、资质证、
 资格证书变更、中止、撤销的决定不服的，等等。 行政复议程序：申请受理与决定复议决定的执行。申请期限为60天，可书面申请，


省属开始大纲：
http://202.61.89.231/rules-5DB8E94302B3A9A7-0A3B0EDDD76F632D


【国考公告发布！】中央机关及其直属机构2021年度考试录用公务员公告
http://sc.offcn.com/html/2020/10/144658.html
报名时间：10月15日8:00至10月24日18:00
报名序号：202101388450
513902198810099331
考试时间：
11月29日上午  9:00—11:00    行政职业能力测验
11月29日下午  14:00—17:00   申论
http://bm.scs.gov.cn/pp/gkweb/core/web/ui/business/article/articledetail.html?ArticleId=8a81f324751ce03c0175222d63700039&id=0000000062b7b2b60162bccd55ec0006&eid=0000000062b7b2b60162bccdd5860007
报考者可于2021年1月登录考录专题网站查询笔试成绩和最低合格分数线。

省属：调解中心岗位 
http://202.61.89.231/content-62-AE3BAF8D11519B75
公共科目笔试原始成绩于2020年12月22日分别在
四川省人力资源和社会保障厅官网“人事考试”专栏、
四川省贸促会网站公布，
报考者请自行登录上述网站查询本人笔试原始成绩。

省考：
http://202.61.89.231/content-45-5C3081CCAFA82528
笔试各科成绩于2021年1月上旬在四川省人力资源和社会保障厅官网(http://rst.sc.gov.cn/)首页“人事考试”专栏上公布



1.装家里：1.1万
2.床+衣柜：4k
3.接亲车子和红包相关：2000
4.婚庆：1w
5.酒席：1200*18 = 2.16w
6.彩礼：6.8w

合计：12.16w - 5000


二爸：3万
林素仙嬢嬢：2万
吴干妈：2万
村书记(木根儿舅舅)：1万
超娃表婶娘：1万
素华嬢嬢：2万
大舅公：1万
共借：12w
 
之前超娃表婶娘转给我1w、爸爸转给我1w。11-11晚上，妈妈给我4w

肖仁和、杨建军、姜洪林、

周健波、吴云坤、罗庆喜、樊文森、

袁世明（他的礼钱需要找机会全部退还）


遇到bug
0.api用法问题
1.逻辑问题
2.缓存问题
3.生命周期问题
4.调用顺序问题

mobx
1.在store当中的callback需要使用runAction
2.绑定界面的字段，都要使用@observable
3.调用方法后，会刷新界面的方法，需要使用@action
4.数据源方法，必须使用@computed get isShiper() {}  返回数据
5.在具体的页面使用：@observer使页面监听字段
6.绑定页面的字段，必须是mobx的一级属性。不能是，属性的属性（错误：mobx.obj.name。正确：mobx.name）

1.手机上下载developer app
2.打开app，登录账号（zhangqi@daqiangtong.com）
3.个人中心，点击“身份验证”。之后，就按照手机的“身份验证流程”走完


出现了不能预料的错误

安卓适配3方库
1.setting.gradle
2.build.gradle(有2个build.gradle文件，这里特指：app目录下的那个)
3.mainApplication.java

Showing Recent Issues
: error: class '(null)' of input object does not respond to either selector writeToFile:options:error: or writeToFile:atomically



两端都已经提交了，
大家在新的引入三方库时，先npm install xx库，
然后删除package.json的小箭头，
然后执行./npm_install，大家有问题没有，
没问题扣1，有问题扣2@全体成员

迁移npm库办法：
1.分别复制packjson和packjson-lock文件到另一端。
2.检查packjson文件对应的版本号是否有尖括号（期望没有尖括号）。
3.然后执行npm install，再检查node_modules/是否有变化（期望没有变化）。
4.检查顶部的  "name": "LogisticsApp",  是否正确。

如何安装三方库：
1.按照文档上的npm install xxx先执行一下。
2.找到库当中的podsep文件。该文件的文件名（或者文件当中又一个name字段），这个名字就是pod需要引入的名字。
3.执行pod isntall
4.保持司机端和物流端一致
5.没有用到的库，不需要做适配


Xcode 打包上传AppStore时，卡在Authentication with the App Store

打开Finder，前往如下文件夹~/Library/Caches/com.apple.amp.itmstransporter/
删除该文件夹内的所有文件
打开终端，在终端输入:
/Applications/Xcode.app/Contents/SharedFrameworks/ContentDeliveryServices.framework/Versions/A/itms/bin/iTMSTransporter



http://192.168.1.223:8080/login?from=%2Fview%2F%25E5%25BC%2580%25E5%258F%2591%25E7%258E%25AF%25E5%25A2%2583%2F



春雨惊春清谷天,夏满芒夏暑相连。 秋处露秋寒霜降,冬雪雪冬小大寒。

建设银行：
6217003810033883391



pod install --repo-update

注意！！！！！如果密码不能登录。请选择验证码方式登录，验证码：1234

gitlab 账号密码： jiangbo 00000000


升级cocoapod sudo gem update --system

版权：成都好伙伴网络科技有限公司

描述：
+86 13980803288
13980803288@qq.com

版权：成都市好伙伴软件发展有限公司

描述：
+86 13980803288
admin@huochaoduo.com

Yiyun Logistics Technology(Tianjin)Co., Ltd.


DEBUG

https://www.pgyer.com/hIMl

17899990001    123456




************************************************************
 1.计划！ 目标 （熟练git，svn的各种用法，不能仅仅局限在提交代码就完了）

 2.执行！坚持执行！（做事情！不能拖！）

 3.工作方面需要注意的点：
 （1）把自己作为一个测试没去思考，可能出现的异常！多思考！
 （2）提交代码前，一定review自己的代码！！！！！！避免低级bug！！！！！
 （3）多看官方文档！！！！反复看
 （4）做事情之前，理清楚需求！多考虑设计模式！
 （4）任务只在指定的分支开发。不要迁移到未指定的分支！！！！
照片用于认证和系统审核

*/



/*
1996.9～2002.6：在简阳市望水中心校读小学
2002.9～2005.6：在简阳市望水乡初级中学读初中
2005.9～2008.6：在简阳市阳安中学读高中
2008.9~2009.6：在伍隍中学高中补习班补习
2009.9～2013.6：在西昌学院电子商务专业读大学

2013.9～至今：从事软件开发（app方向）工作

从事软件编程多年，对各种编程语言都比较熟悉，精通Objective-C,Swift, js

父亲：姜彬华，四川省简阳市望水乡黑水村2组26号，务农
母亲：陈翠萍，四川省简阳市望水乡黑水村2组26号，务农

513902198810099331



创建:

创建一个普通的ios原生类

在.m文件顶部声明一个RN提供的宏：RCT_EXPORT_MODULE();

在.m文件中实现方法（该方法主要是提供数据源）：

  - (NSDictionary *)constantsToExport { 

      return @{@"name": @"货超多",

               @"type": @"科技公司"} 

    } 方法名必须是constantsToExport，不能修改。在该方法中，把我们想要提供给RN的字段组合成一个对象，return出去。



  4.在.m文件中实现另一个方法：+ (BOOL)requiresMainQueueSetup { return YES; } // 方法名字不能修改。目前的版本必须 return YES

使用:

在rn当中需使用的地方引入：

const RNGlobalConstants = NativeModules.RNGlobalConstants ;

console.log(RNGlobalConstants.name) // 货超多

console.log(RNGlobalConstants.type) // 科技公司

说明：RNGlobalConstants就是创建ios原生类的类名。
 



 1. GetDriverSetting接口增加键  AuthTruckTeamWay 表示是否开启车队长模式 1开 0关

 2. GetProcessSetting接口增加返回字段 picMaxNum 用于控制每个节点到另一节点的图片最大数量  重新签收 自由选择使用该接口还是使用 GetLogisticsSetting

 3. GetLogisticsSetting接口增加建  ConsignmentLoadPicNum 、ConsignmentAcceptancePicNum 分别为装车、签收图片最大个数  根据GetPoundPicRequireSetting接口的节点是否必传图片 控制承运回单确认、货主回单确认、编辑回单 的图片
 @app～余杰  @app-姜波 @前端-王南坪
 王、姜 看第三个  余杰全部都看下

@前端-王南坪 @app-姜波 钱包页面，增加通道标识 如果有调余额接口，对象里面直接有，否则 GetView(支付通道)
@前端-王南坪  5690 你拉下ts 联调下运单列表 确认数据无误就点完成 @app-姜波  也一样 虽然任务没有你 app实际也需要拉ts

清华源：https://rubygems.org/

无效合同的情形：
1、一方以欺诈、胁迫的手段订立合同，损害国家利益；

2、恶意串通，损害国家、集体或者第三人利益；

3、以合法形式掩盖非法目的；

4、损害社会公共利益；

5、违反法律、行政法规的强制性规定。

《最高人民法院关于审理民间借贷案件适用法律若干问题的规定》第14条的规定，有下列情形之一，民间借贷合同无效：

1、套取金融机构信贷资金又高利转贷给借款人，且借款人事先知道或者应当知道的；

2、以向其他企业借贷或者向本单位职工集资取得的资金又转贷给借款人牟利，且借款人事先知道或者应当知道的；

3、出借人事先知道或者应当知道借款人借款用于违法犯罪活动仍然提供借款的；

4、违背社会公序良俗的；

另外，未取得商品房预售许可证明就出售房屋的，房屋买卖合同无效。具体到其他类型的合同，需要根据具体情况进行判断。

花呗,借呗,京东白条，等金融平台提现。不放心可以线下交易，手续费低于同行。兼职寒暑假作业、家庭作业代写。需要的联系weixin：kkk242011,qq:1251448896


河南公务员：
桐柏县供销合作社联合社（参照公务员法管理单位）	一级科员	23113011	1	大学专科以上	电子商务类（代码：6308）	18周岁以上、35周岁以下			
信阳市供销合作社(参照公务员法管理单位)	一级科员	25019031	1	大学本科以上	电子商务类	18周岁以上、35周岁以下			
周口市市场监管局网络市场监管分局	一级行政执法员	26017021	1	大学本科以上	电子商务类	18周岁以上、35周岁以下			
正阳县人民检察院	一级科员	27180011	1	大学本科以上	电子商务类	18周岁以上、35周岁以下	
长葛市供销合作社(参照公务员法管理单位)	一级科员	20073021	1	大学本科以上	电子商务类	18周岁以上、35周岁以下			
省商务厅电子商务办公室（参照公务员法管理单位）四级主任科员以下 29105031 1  大学本科以上 电子商务


1.大姨嬢（很瘦的+黄色大衣）：邹容，邹倩
2.二姨嬢（---）
3.三舅（喊大舅）：钱永平爸爸
4.四舅（喊二舅）：钱斯豪，钱思同
5.五姨嬢（喊三姨嬢）：罗金爸爸
6.六姨孃（喊四姨娘）：甘子豪，甘建豪爸爸
7.幺姨孃：冯创，冯标爸爸

*/





