

/*

0.确定上架使用的账号
1.https://developer.apple.com/
2.xcode的设备类型切换为：Generic iOS Device
3.复制bundle identifier, 选中signing & Capabilities 
4.粘贴bundle identifier到对应区域（别按回车）。然后选中对应的开发者账号。
5.product ---> Archive


6.极光推送证书教程：http://docs.jiguang.cn/jpush/client/iOS/ios_cer_guide/


1.处理创建司机ocr识别和提交校验
2.排查处理弹窗高度适配问题，并同步到2端

无感冒发烧咳嗽等症状



// 删除制定的stash
git stash drop stash@{0}

























































第十三届全国人民代表大会第三次会议
1.修改民法典。国家主席习近平签署第45号主席令公布这部法律。
2.建立健全香港特别行政区维护国家安全的法律制度和执行机制的决定
3.


1.梳理4.1需求
2.编写rn和原生共享变量、ios上架流程的开发手册，提交到婵道
3.熟悉react文档

无感冒发烧咳嗽等症状

企业登录：HCDScope.EnterpriseLogon
企业注册：HCDScope.EnterpriseRegister
找回密码：HCDScope.ResetPassword


YD2010120020---保活加强----5s --- 15244444440--川ACC871  --- 10:55登录(全天正常)
YD2010120014---主线----6 --- 18766661911 --川T76511 --- 10:40登录

运单轨迹状态开始上报YD2010120014
运单轨迹状态开始上报YD2010120020

鹰眼的需要多测试下：
1.前台，息屏。
2.充电，一直在前台。
3.前台，打开其他app，息屏。
4.前台，切到后台，息屏。
5.前台，中断网络，之后再连接网络。
6.前台，切换到后台，中断网络，之后再连接网络。
7.前台，打电话，息屏，再切回前台，息屏。
8.前台，息屏，打电话，息屏。（打电话的，可以暂时不测）
@测试-刘冬妮 @app-姜波 @前端-张智超 ，我们也多自测下各种场景。（
主要测试一段时间后，是否收到app异常通知）


























【国考公告发布！】中央机关及其直属机构2021年度考试录用公务员公告http://sc.offcn.com/html/2020/10/144658.html
报名时间：10月15日8:00至10月24日18:00
考试时间：
11月29日上午  9:00—11:00    行政职业能力测验
11月29日下午  14:00—17:00   申论

望水婚庆
15884204801

第一天下午到达--晚上便饭后--酒店睡觉
第二天上午女方酒店门口耍---中午酒店吃饭---下午酒店对面的茶楼斗地主---晚上吃饭---唱歌---斗地主+睡觉
第三天上午，男方过来接亲---中午男方家里吃饭---下午男方家里楼上放家里斗地主----下午坐同路回成都的朋友的车子回成都


第一天(1号)来中午到的---我家里耍---晚上吃了便饭一起去望水住(安排他们到对面的自家茶馆耍？)
第二天(2号)陪我去接亲---回来吃饭---下午和一起回成都的人，回成都


不走高速？

接到望水去住：1600
包车钱：20个人=5个车=400*5 = 2000
接亲车：10个车=120*10 = 1200
合计：4800

直接来中和：来回每个车500左右 * 10 = 5000
和所以司机约好，定位在河边集合。带花，贴标签。

建宏表述，温泉表述，陈功明，幺爸，我自己这个车让谁来开呢？王登文开？
拍结婚证件照
11号回老家了解本地婚庆。选衣柜，
谁背小红包？
婚庆成都的，还是老家的？！！！！
选衣服、选戒指
选烟酒、定菜单
淘宝：选喜字，红绳，各种类型的红包，买请帖
和嬢嬢确定：彩礼用现金，银行卡？。
送彩礼时间：可以是晚上吗？有没有别的习俗？
10-26号去拿雅云送的对戒
10-20去看出门纱
11-02去定制西装，穿样衣。




1.10-09:环游天下-新
2.10-10:卖炭翁智慧（新上架）、货运管家（更新）
3.10-12:双联智运
4.10-13:双联智运、运捷科技(新上架)
5.10-20:拼多啦、金隅冀东


1.装家里：1.1万
2.床+衣柜：4k
3.接亲车子和红包相关：7000
4.婚庆：1w
5.酒席：1200*18 = 2.16w
6.彩礼：6.8w

合计：12.16w


二爸：3万
林素仙嬢嬢：2万
吴干妈：2万
村书记(木根儿舅舅)：1万
超娃表婶娘：1万
素华嬢嬢：2万
大舅公：1万
共借：12w


环境：192.168.1.226:18000
部平台上报成功的运单号: YD2009290048
司机账号：19779767676

"jpushKey": "a1d9b0bd3b6d098303efff0e",  auto_config_json

const COLLECTION = 8; //采集  commons/index

#define YINGYANTIMESTEMPS @"yingYanTimeTimeStempKey"  pch

cocopods阻止了安装


成都好伙伴网络科技有限公司   账号：1080001   密码：hhb43lAsl_adxs
企业密钥：D52F24C9261811EA9C8B40167E2083BB
密码SM4加密后：1707a69e3ca35f3d5dc30e9b942df580
app安全码（安卓）：438d468af75d5179dde5efea62eb6765
app安全码（IOS）：438d468af75d5179dde5efea62eb6765
高德KEY（安卓）：765f77cb5e1b4eafadd695ab0f89052d
高德KEY（IOS）：5787b5772fb43fc33f0a721c8cd50497
企业标识：510010800


物流端 com.hcdpt.logistics
司机端 com.hcdpt.driver

肖仁和、杨建军、姜洪林、

周健波、吴云坤、罗庆喜、樊文森、

袁世明（他的礼钱需要找机会全部退还）


接亲：吴云坤，樊文森，姜伟，陈功明，

跑高速，主婚车的花，会不会被吹烂？？？

遇到bug
0.api用法问题
1.逻辑问题
2.缓存问题
3.生命周期问题
4.调用顺序问题

mobx
1.在store当中的callback需要使用runAction
2.绑定界面的字段，都要使用@observable
3.调用方法后，会刷新界面的方法，需要使用@action
4.数据源方法，必须使用@computed get isShiper() {}  返回数据
5.在具体的页面使用：@observer使页面监听字段
6.绑定页面的字段，必须是mobx的一级属性。不能是，属性的属性（错误：mobx.obj.name。正确：mobx.name）

邛崃市应急管理局
邛崃市安全生产服务中心
邛崃 - 35	行政管理	01035	公共类	管理岗位	1	不限	普通高等教育学历，取得学历相应学位。	1985年1月1日及以后出生。
（一）报名时间
网上报名：2020年9月17日09:00至9月24日17:00。
网上缴费：2020年9月17日09:00至9月25日17:00。
准考证打印：2020年10月14日至10月17日。
笔试暂定于2020年10月17日（星期六）
详细信息在成都人事考试网查看:http://cdpta.cdhrss.chengdu.gov.cn/netpage/examinfo.do

1.手机上下载developer app
2.打开app，登录账号（zhangqi@daqiangtong.com）
3.个人中心，点击“身份验证”。之后，就按照手机的“身份验证流程”走完


出现了不能预料的错误

安卓适配3方库
1.setting.gradle
2.build.gradle(有2个build.gradle文件，这里特指：app目录下的那个)
3.mainApplication.java

Showing Recent Issues
: error: class '(null)' of input object does not respond to either selector writeToFile:options:error: or writeToFile:atomically
























1.请帖和文字<姜波&廖冰雪 诚邀 xxxx到xxxx赴宴>
购买请帖链接：https://item.jd.com/1149540890.html

2.喜糖的结构
酒心巧克力一个+散装糖2～5两（感觉差不多就行）
装喜糖的袋子（作为伴手礼）购买链接：
https://detail.1688.com/offer/583156419197.html?spm=a312h.2018_new_sem.dh_002.15.7c4e5bf1TlUCn7&tracelog=p4p&clickid=63a42b57ee3a4ee4b4ded1a723e28d35&sessionid=b21ba4d4b1f86f4e51d3b3b8f362ff13



拍婚纱照注意事项：
1.https://www.zhihu.com/question/21134127 (重化妆)
2.https://www.sohu.com/a/321907076_120044697 (防商家套路秘籍)
3.https://zhuanlan.zhihu.com/p/47605046 (和摄影师沟通的细节)
4.https://www.jieqinwang.com/baike/19576.html (全过程部分细节和心得)

http://www.tell520.com/wdy/49181.html (网友评论：方方面面)
https://zhidao.baidu.com/question/456432642305521605.html (网友分享的个人心得)

4.衣服、三金。（目前距离11月底近2个月，时间应该够了）
衣服：各2套或者以上（订做或者去店里买）11月底选定。
三金：我们国庆之后，看房子的同时开始在实体店看 + 网上随时选。


5.找人跟我去接亲（吴云坤、樊文森、江邦建、江平、姜伟、陈功明 + 在加一个话多的。(5~8人左右) ）

6.选日子、婚房安排
日子：
计划领证时间：11月11号
领证地点：简阳（四川省简阳市射洪路南段515号）
民政局上下班时间：周一至周五 09:00-11:30,14:00-17:30（待定）
联系方式：(028)27231566(9月日晚之前，主动联系那边咨询一下)
提前踩点时间：9月13号、14号
踩点关注的点：
(1).证件以及需要带上的其他物件，(领证需要带：身份证，户口薄，2寸红底合照3张)
(2).办理流程，各流程地点，
(3).整个流程大概话费多少时间，
(4).缴费方式是否支持微信或者支付宝
(5).其他注意事项

婚房
1.租房。（国庆之后的第一个周末开始看）
2.老家。（提前贴墙纸或者刷白）。不过结完婚之后，还是需要来成都租个房住。


婚车
购买喜字
根据大致的送亲人数约车。载客人数（不含司机） = 大致送亲人数 x 1.5

接亲
提前看天气预报，规划行车路线。
身上带上一推红包。（派给伴娘、司机、已经可能遇到的路人）
身上带烟（蓝轿子、红双喜、云烟）
鲜花？

酒席
如果婚房在成都某小区则：
(1).中午在成都某酒店，第二天根据实际情况(我们一起和父母商量)决定要不要回老家办一个村里的。
(2).其他需要补充的
如果婚房在老家则：
(1).送亲的人的主席位，怎么摆
(2).定好菜单

其他



1.财险信息是不是是i必传
2.推广码会不会有部分企业，没有推广码

两端都已经提交了，
大家在新的引入三方库时，先npm install xx库，
然后删除package.json的小箭头，
然后执行./npm_install，大家有问题没有，
没问题扣1，有问题扣2@全体成员

迁移npm库办法：
1.分别复制packjson和packjson-lock文件到另一端。
2.检查packjson文件对应的版本号是否有尖括号（期望没有尖括号）。
3.然后执行npm install，再检查node_modules/是否有变化（期望没有变化）。
4.检查顶部的  "name": "LogisticsApp",  是否正确。

如何安装三方库：
1.按照文档上的npm install xxx先执行一下。
2.找到库当中的podsep文件。该文件的文件名（或者文件当中又一个name字段），这个名字就是pod需要引入的名字。
3.执行pod isntall
4.保持司机端和物流端一致
5.没有用到的库，不需要做适配


Xcode 打包上传AppStore时，卡在Authentication with the App Store

打开Finder，前往如下文件夹~/Library/Caches/com.apple.amp.itmstransporter/
删除该文件夹内的所有文件
打开终端，在终端输入:
/Applications/Xcode.app/Contents/SharedFrameworks/ContentDeliveryServices.framework/Versions/A/itms/bin/iTMSTransporter



http://192.168.1.223:8080/login?from=%2Fview%2F%25E5%25BC%2580%25E5%258F%2591%25E7%258E%25AF%25E5%25A2%2583%2F

需要删掉：TabUtils
15988881234
driver-3.42.20.100-jiangbo

获取token、手机号、地区数据、版本号

小程序tianjin-jiangbo上有部分bug，没有迁移到 hcd-stable (2020-8-8的修改).


17780735020----司机


BillReview.getPatternSetService().getPatternSet()
AuthApi.getAccountService().getUserAppLimit()


春雨惊春清谷天,夏满芒夏暑相连。 秋处露秋寒霜降,冬雪雪冬小大寒。

建设银行：
6217003810033883391

7-6号封板

对于司机来说，司机不能开立预充值账户，所以司机的balance=0
可用余额就是可提现余额drowMoney




翼闪运2端
拼多啦司机端----设计重复
一号物流司机端-----需要定位视频 --- 售后说不管了
兖矿智慧司机端   需要定位演示视频
罐车帮司机端-需要演示视频
兰花智运司机端，需要定位演示视频

showInfo.sourceOrderTrend.value

1.司机提交异常
2.承运确认无货（非直发）
2.货主确认无货（直发）

3.货主确认无货


定位信息演示视频，已经添加到附件当中


APP架构线：
APP:
1.APP单元测试（重点模块认证模块、支付）
2.android调研逐步使用jetpack提供的一些库（比如数据绑定、生命周期等等）
3.逐步逐步使用react hooks
4.url请求拦截完善调研，若快速访问，缓存之前的请求。
5.考虑设计APP一键换肤，自动化换背景图。
6.扩展封装列表，按时间筛选。
小程序：
1.小程序鹰眼服务进一步优化，优化上传的逻辑算法。
2.小程序单元测试（重点模块司机认证、车辆认证）
3.优化小程序打包配置，比如压缩CSS样式代码、压缩JS代码。
4.小程序逐步逐步使用react hooks 。
5.小程序taro版本升级。


pod install --repo-update

注意！！！！！登录方式，请选择验证码登录，验证码：1234

gitlab 账号密码： jiangbo 00000000


升级cocoapod sudo gem update --system

版权：成都好伙伴网络科技有限公司

描述：
+86 13980803288
13980803288@qq.com

版权：成都市好伙伴软件发展有限公司

描述：
+86 13980803288
admin@huochaoduo.com

Yiyun Logistics Technology(Tianjin)Co., Ltd.


DEBUG

https://www.pgyer.com/hIMl

17899990001    123456


./gradlew assemblehcdtestDebug
./gradlew assemblehcdlineDebug

./gradlew assemblehcdlineRelease
./gradlew assemblehcdtestRelease


// http://www.bdhwlxx.com/res.html

rm -rf ~/library/developer/xcode/deriveddata

./gradlew clean


ReceiptManageListDtoPageListOutput --- ReceiptManageListDto（数组对象）
ReceiptListOutputPageListOutput ---现在的回单对象 ---ReceiptListOutput
freightPrice
priceUnit_Text
（数组对象）

npm run dev:weapp
npm run dev:h5

F/2, 1000 Miboyu Technology, Beixing, Garage, Yinhe Road, Zhengzhuangzi Town, Kaiping District


5.
1.cd到安卓目录下
2.执行打包命令 ./gradlew assemblehcdtestDebug
3.打包完成后，执行adb install app/build/outputs/apk/（安装app到链接的手机）。
例如：adb install app/build/outputs/apk/hcdtest/debug/app-hcdtest-debug.apk

完成时候，cd到rn的packjson目录，执行npm start
4.adb reverse tcp:8081 tcp:8081（把手机网络和手机网络同步）平时：该命令在任何目录下执行 ，都是可以的。
5.app启动过程有可能会卡住，重启app就可以了。
6.ok 另外，附带一个模拟 摇一摇reload的命令：adb shell input keyevent  82 (该命令在rn的安卓工程目录下执行)


************************************************************
 1.计划！ 目标 （熟练git，svn的各种用法，不能仅仅局限在提交代码就完了）

 2.执行！坚持执行！（做事情！不能拖！）

 3.工作方面需要注意的点：
 （1）把自己作为一个测试没去思考，可能出现的异常！多思考！
 （2）提交代码前，一定review自己的代码！！！！！！避免低级bug！！！！！
 （3）多看官方文档！！！！反复看
 （4）做事情之前，理清楚需求！多考虑设计模式！
 （4）任务只在指定的分支开发。不要迁移到未指定的分支！！！！
照片用于认证和系统审核

*/



/*
1996.9～2002.6：在简阳市望水中心校读小学
2002.9～2005.6：在简阳市望水乡初级中学读初中
2005.9～2008.6：在简阳市阳安中学读高中
2008.9~2009.6：在伍隍中学高中补习班补习
2009.9～2013.6：在西昌学院电子商务专业读大学

2013.9～至今：从事软件开发（app方向）工作

从事软件编程多年，对各种编程语言都比较熟悉，精通Objective-C,Swift, js

父亲：姜彬华，四川省简阳市望水乡黑水村2组26号，务农
母亲：陈翠萍，四川省简阳市望水乡黑水村2组26号，务农


四川省事业单位考试综合知识整理(包含全书知识点)下载文档
2
 / 29
第一篇  法律  第一章  法理 法的含义： 法是国家制定或认可的以权利和义务为主要内容并通过国家强制力保证实施的、反映统治阶级意志的调整行为关系的社会规范。 法的特征： 1.对象性。法是调整人的行为进而调整社会关系的规范。法以一定的社会关系为调整对象，而道德、宗教规范主要是通过约束控制人的思想来完成社会关系的调整。           2.国家性。国家制定、认可和解释，有普遍约束力的社会规范。           3.规范性。法是规定权利和义务的社会规范，权利和义务是主要内容，道德、宗教也规定义务，但轻视权利。不承认利益。           4.强制性。法是由国家强制力保证实施的社会规范。其它许多社会规范也有强制力，但不具有国家性。 法的规范作用：大体上概括为指引、评价、预测、教育、强制五种作用。指引作用是指对个人行为起导向和引路作用。 评价作用是指法作为人们对他人行为的评价标准所起的作用。 预测作用指根据法可以预先估计人们相互之间将怎样行为以及行为的后果等。 教育作用是指法的实施对一般人的行为产生影响，对象是一般人的行为。
强制作用是指法可以用来制裁、强制、约束违法犯罪行为。 法的分类：1.按创制方式和表达形式分为成文法（又称制定法，特定机关制定和公布并以法律条文形式出现的法律）与不成文法（一般指习惯法，有法律效力，但不具
有条文形式）； 2.按内容的不同为标准分为实体法（以规定和确认权利与义务或职权与职责为主的法律，如民法、刑法、行政法）与程序法（以保证权利和义务得以实施或
职权和职责得以履行的有关程序为主的法律，如民事、刑事、行政诉讼法） 3.按法律的地位、效力、内容、制定主体、程序的不同分为根本法（即宪法）
和普通法，普通法指宪法以外的法律。 4.一般法与特别法，这是按法律的适用范围不同所作的公类。 5.国内法与国际法。（以上五种分法是法律的一般分类） 法律的特殊分类： 1.公法与私法。 2.普通法与衡平法，普通法是专指11世纪后由法官通过判决形式逐渐形成的适用于全英格兰的一种判决例法；衡平法是指英国大法官们在14世纪以后以公平正义原则和规则对普通法的修正和补充而出现的一种判决例法。  法的效力：是指法律的生效范围和适用范围，对什么人，在什么地方和什么时间适用的效力。 时间效力：法的生效时间主要有以下几种形式1.自法律公布之日起；2.由该法本身规定生效时间；3.由专门决定规定某法的生效时间；4.规定法律公布后满足一定条件时生效。           法的终止效力的时间，有明示废止和默示废止两类 法的制定与实施：
事业编考试内容 历年真题，考上缴费，备考资料领取
广告 易尚事业编考试内容，专业辅导老师帮助规划备考时间; 查看详情 >
          我国现行的立法体制为“一元，两级，多层次”，一元指根据宪法规定我国是一个单一制的、统一的多民族国家，我国有立法体制是统一的一元化的，全国范围内只存在一个统一的立法体系。两级指根据宪法规定，我国立法体制分为中央立法和地方立法两个等级。多层次是指根据宪法规定，不论是中央级立法，还是地方级立法，都可以各自若干个层次和类别。 国家机关立法职能及权限：1.全国人大制定和修改刑事、民事、国家机构的和其他的基本法律。全国人大常委会制定和修改除应当由全国人大制定的法律以外的其他法律，在全国人大闭会期间，对全国人大制定的法律进行补充和修改。           2.国务院制定行政法规。           3.国务院各部、委员会、中国人民银行，审计署在本部门的权限范围内，制定规章. 4.省、自治区、直辖市的人民代表大会及其常季会可以制定地方性法规。 5.省、自治区、直辖市可制定规章 6.民族自治地方的人民代表大会制定适用于本民族区域自治范围内的自治条例
和单行条例。 法律制定程序：法律案提出；法律案的审议；法律草案表决；法律的公布。 法的实施： 包括执法、司法、守法。执法专指国家行政机关、公务员及授权组织依照法定职权和程序，贯彻和实施法律的活动。有以下特征：主体是国这行政机关和所属的公职人员，以及法律授权和委托的组织及人员；执法内容广泛性；执法活动具有单方面性；执法活动具有主动性。司法：又称为“法的适用”，“法律适用”，是指国家司法机关依照法定职权和程序，具体适用法律处理各种案件的专门活动。这种专门活动是以国家名义实现其司法权的活动，属于国家的基本职能之一。守法：是指国家机关、社会组织和公民个人依照法的规定，行使权利（权力）和履行义务（职责）的活动。， 法律关系： 是指法律 在调整社会关系的过程中所产生的人们之间的权利和义务关系。法律关系是以权利义务为内容 的社会关系；法律权利和义务的内容是法律关系
区别于其他社会关系的重要标志。 法律关系的结构：由主体、客体和内容三大要素构成。法律上的人主要包括法人与自然人。            法人一般可分为企业法人、事业法人、机关法人、社团法人。参加任何法律关系都必须具有权利能力，特定类型的法律除此之外还必须具有行为能力。权利能力是由法律所确认的法律关系主体享有权利或承担义务的资格，是参加任何法律关系都必备的前提条件。公民的权利能力分为一般权利能力（始于出生，终于死亡）和特殊权利能力（如选举权要达到法定年龄为条件）。行为能力是
法律所确认的，由法律关系主体通过
自己的行为行使权利和履行义务的能力。三类自然人：完全行为能力人（成年且神智正常）；限制行为能力人（未成年且已满一定年龄的人和患有精神疾病但尚具有识别能力的人）；无行为能力人（未达到一定年龄的幼童和完全失去控制与识别能力的精神病人）。           法律关系的客体通常包括：物、人身利益，智力成果，行为。 法律责任：指行为人由于违法行为、违约行为、或者由于法律的规定而应承受的某种不利的法律后果。分为民事、刑事、行政、违宪责任。           民事责任：主要是财产责任；民事责任可由当时人协商解决；分为违约、一般侵权、特殊侵权、公平责任。 法律责任构成：责任主体、违法行为、损害结果、因果关系、主观过错。其实现形式：惩罚（制裁）、补偿（赔偿）、强制。
公务员考试2020_历年试题_考点解析_新版教辅
广告 公务员考试2020精华+出题规律解析+新政考点预测，适用于2020年公务员复习备考 查看详情 >

第二章  宪法 宪法：    是规定国家根本制度和根本任务、集中表现各种政治力量对比关系、保障公民权利的国家根本法。宪法的修改方面三个小知识点：第一，宪法的修改有两个主体有权提出，即全国人大常委会和1/5以上的全国人大代表。第二，宪法修正案的通过由全国人大以全体的2/3以上的多数通过。第三，全国人大制定的法律由全国人大以全体代表的过半数通过。           1918年全俄苏维埃代表大会制定 了世界第一部社会主义宪法，《苏俄宪法》。           1908年清政府颁布的《钦定宪法大纲》是中国历史上第一个宪法性文件。 国家机构：我国的国家机构由国家元首（国家主席）、权力机关（人大及常委会）、行政机关（政府）、司法机关（法院与检察院）、军事机关所构成。国家机构的组织和活动原则有：1.民主集中制原则；2.法治原则；3.责任制原则。           全国人大是最高权力机关，最高的国家立法机关。每届任期5年。职权有：修改宪法和监督安宪法实施；制定和修改国家基本法律；监督权， 全国人大选举全国人大常委会委员长、秘书长和委员，选举国家主席、副主席，中央军委主席、最高人民法院院长、最高人 民检察院院长，决定国务院总理人选、决定副总理、国务委员、各部部长、各委员会主任、审计长和秘书长的人选，决
定中央军委副主席和委员人选。           中央人民政府即国务院，是最高国家权力机关的执行机关，是最高国家行政机关。           国家主席的职权：公布法律，发布命令；任免国务院的组成人员和驻外全权代表；外交权；荣典权。           中央军委每届任期5年，但宪法没有对军委主席连续任职问题作出规定。           人民法院是国家的审判机关；人民检察院是国家的监督机关。           各级人民代表大会：我国共有五级人大，即全国、省级、市级、县级、乡级人大。乡级人大没有常委会，也不有刑事豁免权。
        我国有五级人大，相应有五级政府，即中央、省级、市级、县级、乡级政府。 公民的权利与义务：公民的权利有：1.平等权； 2.宗教信仰自由； 3.政治权利和自由（选举权，具备三个条件：中国公民；年满18周岁；没有被剥夺政治权利）； 4.监督权； 5.人身自由； 6.财产权； 7.社会经济、教育、文化方面的权利；8.特定主体的权利。           公民的义务：1.
维护国家的统一和各民族的团结； 2.遵守宪法和法律； 3.维护祖国的安全、荣誉和利益； 4.保卫祖国。抵抗侵略、依法服兵役和参加民兵组织； 5.依法纳税。此外还有劳动的义务，受教育的义务。 独立自主是中国对外政策的根本原则;和平共处五项原则是中国处理同 一切国家关系的基本准则
「中公」2020事业单位考试题库-事业单位考试难吗?如何备考?
广告 2020事业单位考试题库，事业单位考试全程备考尽在中公事业单位! 查看详情 >
第三章  行政法 行政法：   就是有关国家行政机关的职责、权限、工作原则和活动程序的法律规范的总称，它有以下特征：行政法尚未形成统一、完整的实体法典；行政法律规范的数量众多、内容广泛；行政法的内容定于多变性。 行政法基本原则;1.行政合法性原则 ；2.行政合理性原则。 行政法律关系主体：1.行政主体，主要包括：行政机关,行政机关是最主要的行政主体，但不是所有行政机关都能成为行政主体，能灰飞烟灭的有国务院、国务院组成部门、国务院直属机构、地方各级人民政府、地主人民政府的工作部门、地主人 民政府的派出机关；派出相关及派出机构；法律法规授权的组织。            2.行政相对人，简称相对人，是指在行政管理 中处于被管理地位的公民、法人、或其他组织。 行政授权： 是指法律、法规、规章对一个本无独立行政职权的机构或者组织，授予行政职权从而使具备行政主体的资格 的行为。 行政委托： 是指导行政机关在其他职权职责范围内依法将其行政职权或行政事项委托给有关行政机关、这会组织或个人。 行政行为：是指行政主体在实施行政管理活动、行使行政职权过程中所作出的具有法律意义的行为。特征有：行政行为必须是行政主体所为的行为；行政行为是行使行政职权的行为。抽象行政行为：也称“行政立法行为”，是具体行政行为的对称，其对象具有普遍性。抽象行政行为具有以下特征：1.对象的普遍性；2.效力的普遍性的持续性；3.准立法性；4.不可诉性。具体行政行为，是指行政机关行使政权力，对特定公民、法人、和其他组织作出的有关其权利义务的单方行为。            1.行政处罚，是指法定的行政主体对违反行政法律规范，破坏行政法律秩序但尚未构成犯罪的公民、法人、其他组织所实施的惩戒行为。处罚类型有：（1）警告；（2）罚款；（3）没收；（4）责令停产停业；（5）暂扣或吊销许可证、执照；（6）行政拘留；（7）法律、行政法规规定的其他行政处罚。            2.行政许可，是一种依申请有的行政行为；是授益性行为，是要式行政行为。分为一般许可；特许；认可；核准；登记。原则上只有全国人大及其党委会、国务院和省级地方人大及常委会可以设定行政许可。            3.行政强制，强制措施及强制执行。对人身自由的强制措施有以下几种：强制隔离；强制治疗；收容教育；强制戒毒；除以上几种外，还有对不接受传唤或逃避传唤的人实施的强制传唤、对公共场所酗酒的人实施的强制约束、对闹事者采取的强行带离现场或驱散等。针对 涉案财产所采取的强制措施有：查封；扣押；冻结。强制执行；分直接和间接执行（代执行和代行罚）                       4.行政裁决，其特征为：主体是法律授权的特定的行政机关；对象是特定的民事纠纷；是行政主体实行的一种特殊的具体行政行为；具有准司法性，行政机关在实施行政裁决时是以第三者的身份居间裁决民事纠纷，有司法性质，同时又是以行政机关的身份裁决争议，具有行政性质。 行政复议： 行政复议机关依法对具体行政行为的合法性、合理性进行审查。公民、法人、其他组织可以依法申请行政复议的情形有：对行政机关作出的行政处罚不服的；对行政强制措施不服的；对行政机关作出的有关许可证、执照、资质证、
资格证书变更、中止、撤销的决定不服的，等等。 行政复议程序：申请受理与决定复议决定的执行。申请期限为60天，可书面申请，
京东事业单位招考笔试题
广告 事业单位招考笔试题，京东低价来袭!支持货到付款，全国联保!立即上京东，体验不一样"快"购! 查看详情 >
也可口头申请，作出该具体行政行为的行政机关为被申请人。收到申请后应当在5天内进行审查，行政复议机关应当自受理申请日起60天内作出复议决定，可延长限期，但不得超过30天。 行政诉讼： 是指公民、法人或者其他组织主为行政机关和行政机关工作人员的具体行政行为侵犯其合法权益向人民法院提起诉讼和一种诉讼活动，有以下特征：行政诉讼的原告只能是作为行政管理相对人的公民、法人和其他组织，被告只能是作为行政管理方的行政主体；行政诉讼是法院作为中立的裁判者通过适用司法程序解决行政争议的活动；行政复查对象是作为被告的行政机关、法律法规授权的组织作出具体行政行为的合法性。人民法院不审查抽象行政行为的合法性，
只审查具体行政行为的合法性，且只有在例外挂情况下才审查其合理性。            下列情形不属于人民法院行政诉讼的受案范围： 1. 国防、外交等国家行为 ； 2. 行政法规、规章或者行政机关制定、发布的具有普遍约束力的决定、命令； 3. 行政机关对行政机关工作人员的奖惩、任免等决定； 4. 法律规定由行政机关最终裁决的具体行政行为； 5. 公安、国家安全等机关依照《刑事诉讼法》的明确授权实施的行为； 6. 调解行为以及法律规定的仲裁行为； 7. 不具有强制力的行政指导行为； 8. 驳回当事人对行政行为提起申诉的重复处理行为； 9. 对公民、法人、或者其他组织权利义务不产生实际影响的行为。 管辖：(一)级别管辖 1. 基层人民法院管辖第一审行政案件。 2. 中级人民法院管辖以下第一审行政案件：确认发明专利权的案件、海关处理案件、对国务院各部门或者省、自治区、直辖市人民政府所作的具体行政行为提起诉讼的案件、本辖区 内重大 复杂的案件。 3. 高级人民法院管辖本辖区内重大复杂的第一审行政案件； 4. 最高人民法院管辖全国范围内重大复杂的第一审行政案件。   （二）地域管辖 （三）裁定管辖，不是根据法律的直接规定，而是由人民法院直接确定行政和管辖法院。
获取文档，使用更方便

VIP免费下载
VIP文档免费下 付费文档8折购 文档格式随意转

牙刷自动-「京东」家电,火爆热销,超值特惠,质量优!
上「京东」购家电,各类精选品牌,各种臻品行货,High不停!「京东」品类全,折扣狠,送货快,省事又省心,享受愉快购物就上「JD.com」!
广告查看详情
版权说明：本文档由用户提供并上传，若内容存在侵权，请进行举报或认领
1234567890ABCDEFGHIJKLMNabcdefghijklmn!@#$%^&&*()_+.一三五七九贰肆陆扒拾，。青玉案元夕东风夜放花千树更吹落星如雨宝马雕车香满路凤箫声动玉壶光转一夜鱼龙舞蛾儿雪柳黄金缕笑语盈盈暗香去众里寻他千百度暮然回首那人却在灯火阑珊处
搜索 复制   发送到手机  翻译
文字已复制
选择内容扫一扫
立即发送到手机
VIP享无限制发送特权
以下结果由  提供：×
百度翻译


创建:

创建一个普通的ios原生类

在.m文件顶部声明一个RN提供的宏：RCT_EXPORT_MODULE();

在.m文件中实现方法（该方法主要是提供数据源）：

  - (NSDictionary *)constantsToExport { 

      return @{@"name": @"货超多",

               @"type": @"科技公司"} 

    } 方法名必须是constantsToExport，不能修改。在该方法中，把我们想要提供给RN的字段组合成一个对象，return出去。



  4.在.m文件中实现另一个方法：+ (BOOL)requiresMainQueueSetup { return YES; } // 方法名字不能修改。目前的版本必须 return YES

使用:

在rn当中需使用的地方引入：

const RNGlobalConstants = NativeModules.RNGlobalConstants ;

console.log(RNGlobalConstants.name) // 货超多

console.log(RNGlobalConstants.type) // 科技公司

说明：RNGlobalConstants就是创建ios原生类的类名。

*/